Repository: AntennaHouse/focheck
Catalog: omegat/omegat/project_save.tmx
Source language: en_us
Languages: ja

source: The fo:wrapper formatting object is used to specify inherited properties for a group of formatting objects.
ja: 仕様項目グループの継承されたプロパティを指定するとfo:wrapperを使用しています。

source: The full set of conditions allows different page-masters to be used for the first page, for odd and even pages, for blank pages, etc.
ja: 揃えた条件は、異なるpage-mastersは、最初のページ、奇数と偶数ページ、 空白ページなどのために使用することができます。

source: The gap between columns: <length> | <percentage>
ja: 段と段の間： <length> | <percentage>

source: The hierarchy level of bookmark items: <number>
ja: しおりの項目の階層レベル

source: The layout of these pages comes from the fo:page-sequence-master or page-master referenced by the master-reference trait on the fo:page-sequence.
ja: これらのページレイアウトが fo:page-sequence-master 又は、 fo:page-sequenceにmaster-reference特色によって参照されたpage-master から来ています。

source: The most important property is the "column-width" property.
ja: 最も重要なプロパティは、「column-width」 プロパティです。

source: The number of columns: <number>
ja: 段数： <number>

source: The number of repetitions may be bounded or potentially unbounded.
ja: 繰り返し数は、囲まれていて、潜在的に囲まれていない可能もあります。

source: The object allows for traversal to the destination resource, typically by clicking on any of the containing areas.
ja: オブジェクトは、一般的に含む領域のいずれかをクリックすることで、先のリソースの走査を許します。

source: The overflow trait controls how much of the underlying region-reference-area is visible; that is, whether the region-reference-area is clipped by its parent region-viewport-area.
ja: オーバフロー形質は、下にあるregion-reference-area のどのくらいが表示されているコントロールします。すなわち、region-reference-area は 親 region-viewport-areaによって切取りされているかどうか。

source: The page is subdivided into regions: one or more region-body, and up to four other regions: region-before, region-after, region-start, and region-end.
ja: ページ領域に細部されています：１以上の region-bodyまたは、４つまでの他の領域： region-before、 region-after、region-start、region-end。

source: The sequence of areas returned by each of the flow-object children of the fo:page-sequence are made descendants of the generated pages as described below.
ja: fo:page-sequenceのそれぞれの flow-object 子によって返される領域のシーケンス が生成されたページの子孫を作られて、以下のように説明します。

source: The way a link opens in a link destination
ja: リンクは、リンク先に開く方法

source: The way to trim spaces between characters in justified text
ja: 文字の間を詰めの対象として追い込みの処理方法

source: There must be at least one fo:page-sequence descendant of fo:root.
ja: fo:rootの少なくとも一つのfo:page-sequenceの子孫でなければなりません。

source: This allows different page-masters to be used, for example, for even and odd pages, for the first page in a page-sequence, or for blank pages.
ja: これは、異なるpage-mastersは、 奇数と偶数ページ、 page-sequenceの最初のページ、空白ページなどのために使用することができます。

source: This includes page-sequence-masters, page-masters, and flow-maps.
ja: これは、page-sequence-masters、 page-masters、 flow-mapsが含まれています。

source: This is the top node of the formatting object tree.
ja: これは、formatting objectツリーのトップノードです。

source: This region specifies a viewport/reference pair that is located in the "center" of the fo:simple-page-master.
ja: この領域は、fo:simple-page-masterの「center」に位置している表示域/参照ペアを指定します。

source: This region specifies a viewport/reference pair that is located on the "after" side of the page-reference-area.
ja: この領域は、page-reference-areaの「after」側に位置している表示域/参照ペアを指定します。

source: This region specifies a viewport/reference pair that is located on the "before" side of the page-reference-area.
ja: この領域は、page-reference-areaの「before」側に位置している表示域/参照ペアを指定します。

source: This region specifies a viewport/reference pair that is located on the "end" side of the page-reference-area.
ja: この領域は、page-reference-areaの「end」側に位置している表示域/参照ペアを指定します。

source: This region specifies a viewport/reference pair that is located on the "start" side of the page-reference-area.
ja: この領域は、page-reference-areaの「start」側に位置している表示域/参照ペアを指定します。

source: This title may be used by an interactive User Agent to identify the pages.
ja: このタイトルは、ページを 聞き分けるための対話のUser Agent によって使用できます。

source: This usage is typical in chapters of a book or report where the first page has a different layout than the rest of the chapter and the headings and footings on even and odd pages may be different as well.
ja: この使用法は本や報告の章に一般的な物です。最初のページには、章の残り部分とは異なるレイアウトになって、偶数と奇数ページの見出しとフッタの異なる場合もあると言うことです。

source: Token should be 'auto', 'scale-to-fit', 'scale-down-to-fit', 'scale-up-to-fit', or 'inherit'.
ja: トークンは「auto」、「scale-to-fit」、「scale-down-to-fit」、「scale-up-to-fit」又は「inherit」でなければなりません。

source: Token should be 'auto'.
ja: トークンは「auto」でなければなりません。

source: Token should be 'left', 'center', 'right', or 'inherit'.
ja: トークンは「left」、「center」、「right」又は「inherit」でなければなりません。

source: Token should be 'none' or 'inherit'.
ja: トークンは「none」又は「inherit」でなければなりません。

source: Token should be 'repeat', 'repeat-x', 'repeat-y', 'no-repeat', or 'paginate'.
ja: トークンは「repeat」、「repeat-x」、「repeat-y」、「no-repeat」又は「paginate」でなければなりません。

source: Token should be 'top', 'center', or 'bottom'.
ja: トークンは「top」、「center」又は「bottom」でなければなりません。

source: Token should be 'uniform', 'non-uniform', or 'inherit'.
ja: トークンは「uniform」、「non-uniform」又は「inherit」でなければなりません。

source: Typical conditions include, testing whether the page which is generated using the alternative is the first or last page in a page-sequence or is the page blank.
ja: 特異条件は代替を使用して生成されたページは、page-sequenceの最初又は最後のページであるか、ページの空白であうかどうか含みます。

source: Unicode normalization to perform on text
ja: Unicode の文字列の正規化処理

source: Used in constructing a simple-page-master.
ja: simple-page-masterを構成するのに使用される。

source: Value of the document information.
ja: 文字情報の値

source: Vertical (or horizontal if writing-mode is vertical) float alignment: none | before | after | top | bottom | left | right | center | inside | outside
ja: 垂直方向のフロート配置 （writing-modeがverticalのときは水平方向 ）： none | before | after | top | bottom | left | right | center | inside | outside

source: Wdth of the bleed region: <length>
ja: 塗り足しの領域の幅： <length>

source: Wdth of the bottom bleed region: <length>
ja: 塗り足しの領域の下の幅: <length>

source: Wdth of the left bleed region: <length>
ja: 塗り足しの領域の左の幅: <length>

source: Wdth of the right bleed region: <length>
ja: 塗り足しの領域の右の幅: <length>

source: Wdth of the top bleed region: <length>
ja: 塗り足しの領域の上の幅: <length>

source: Whether Composition Exclusions are excluded or not when the normalization (axf:normalize) is specified
ja: 文字列の正規化「axf:normalize」の時に、合成除外文字「Composition Exclusions」を除外するかどうか を指定します

source: Whether emphasis marks are made Italic
ja: 圏点を斜体にするかどうか

source: Whether the float is centered when the extent for the text placed before and after the float is insufficient: none | auto | <length> | <percentage>
ja: フロートの前後にテキストを配置する高さが足りないときフロートをセンタリングするかどうか： none | auto | <length> | <percentage>

source: Whether the float is centered when the width for the text wrapping around the float is insufficient: none | auto | <length> | <percentage>
ja: フロートへのテキスト回り込みのための幅が足りないときフロートをセンタリングするかどうか： none | auto | <length> | <percentage>

source: Whether the float moves to the next page (or column): auto | next | auto-next | auto-move | keep | keep-float
ja: フロートは次のページまたは段に送るかどうか： auto | next | auto-next | auto-move | keep | keep-float

source: Whether to add space surrounding ideographic glyphs: none | [ ideograph-numeric || ideograph-alpha || ideograph-parenthesis ] | auto
ja: 和欧文間にアキを入れるかどうか： none | [ ideograph-numeric || ideograph-alpha || ideograph-parenthesis ] | auto

source: Whether to arrange a footnote and an anchor in the same page
ja: 脚注とアンカを同一ページ内または段内に配置するように

source: Whether to copy the contents of a cell when a cell breaks
ja: セルの分割時にセル内容をコピーするかどうか

source: Whether to delete duplicated page numbers
ja: 同一のページ番号を削除するかどうか

source: Whether to delete footnotes duplicated in the same page
ja: 同一ページ内の同一の脚注を削除するかどうか

source: Whether to display the area beyond the finished page size
ja: 仕上がり寸法からはみ出した領域を表示するかどうか

source: Whether to display the lower hierarchy of bookmark items or not
ja: しおりの初期状態で、下位の階層を表示するかどうか

source: Whether to enable line breaking even inside a word
ja: 単語の途中でも行分割可能にするかどうか

source: Whether to forcibly break a word when line break cannot be performed
ja: 行分割できないとき、無理やり分割するかどうか

source: Whether to forcibly expand a leader
ja: リーダを強制的に広げるかどうか

source: Whether to hang punctuations at the start of the line or end of the line: none | [ start || first || [ force-end | allow-end ] || last ]
ja: 行頭での突き出し、行末でのぶら下げを行うかどうか： none | [ start || first || [ force-end | allow-end ] || last ]

source: Whether to hyphenate an already hyphenated word
ja: すでにハイフン付けされている語をハイフネーションするかどうか

source: Whether to justify NON-BREAKING SPACE
ja: NON-BREAKING SPACE を均等割り付けの対象にするかどうか

source: Whether to make the font style italic
ja: 斜体にするかどうか

source: Whether to perform kerning
ja: カーニング（詰め処理）を行うかどうか

source: Whether to perform the ligature processing: none | [ latin || kana ] | all | auto
ja: リガチャ（合字処理）を行うかどうか： none | [ latin || kana ] | all | auto

source: Whether to print SOFT HYPHEN (U+00AD)
ja: SOFT HYPHEN (U+00AD)を印刷するかどうか

source: Whether to repeat the fo:footnote in the fo:table-footer that is repeated by table-omit-footer-at-break="false"
ja: table-omit-footer-at-break="false" によって繰り返された fo:table-footer 中の fo:footnote も繰り返すかどうか

source: Whether to repeat the fo:footnote in the fo:table-header that is repeated by table-omit-header-at-break="false"
ja: table-omit-header-at-break="false" によって繰り返された fo:table-header 中の fo:footnote も繰り返すかどうか

source: Whether to show line continued marks: <string>
ja: 行継続マークを表示するかどうか： <string>

source: Whether to show line numbers
ja: 行番号を表示するかどうか

source: Which of the alternative page-masters is used at any point in the sequence depends on the evaluation of a condition on the use of the alternative.
ja: 代替page-mastersのどちらの順序で任意の位置で使用していますが、代替の使用に条件の評価に依存します。

source: Which side of base characters emphasis marks are put
ja: 圏点を親文字のどちら側に付けるか

source: Which side of the character the space by letter-spacing is distributed
ja: letter-spacingによるアキを文字のどちら側に付けるか

source: Which side of the text to put underline in vertical writing-mode
ja: 縦書きでの下線（傍線）をどちら側に付けるか

source: Width for axf:text-autospace
ja: 和欧文間のアキ量

source: Width of line numbers: auto | <length>
ja: 行番号の幅： auto | <length>

source: Width of the diagonal border
ja: 対角罫の幅

source: Width of the reverse diagonal border
ja: 逆対角罫の幅

source: Width of the revision bar
ja: 改訂バーの幅

source: XSLTの名前空間を使用する。 スキーマエラー： <include>のために空hrefの属性がある。 エラー: Schematron <include>には不可能なURL がある エラー: 参照したファイルが含まれて、開けない : スキーマエラー：全体のスキーマではなく、フラグメントを含む <include> を使用する。 スキーマエラー： 'xslt2'の検索言語結合を使用している場合はXSDスキーマのみ読み込みできる。 スキーマエラー：ISO Schematron の名前空間には <import-schema>の要素は無効です。 XSLTの 名前空間を使用する。 注意: 変数は、"xpath" 検索言語結合を使用すべきではない。 注意: 変数は、"xpath" 検索言語結合を使用すべきではない。 マークアップエラー: <ns>にはuriの属性がない マークアップエラー: <ns>にはprefixの属性がない スキーマ実行 エラー: このスキーマは抽象的なパターンを持って、まだすでに前加工されることになっている。 マークアップエラー: <phase>にはidの属性がない マークアップエラー: <rule>にはcontextの要素がない マークアップエラー: 抽象的な <rule>にはid属性がない。 マークアップエラー: (2) 抽象的な <rule>にはcontext属性がない。 マークアップエラー: 抽象的な <rule>にはcontext属性がない。 マークアップエラー: <value-of>には selectの属性がない 注意: 子要素が含まれなくてはならない 参照エラー: 診断は " " 参照されているが宣言されていない。 注意: Schematron規則で"xsl"以外の接頭辞 XSLT 名前空間を使用することは、このプロセサーで サーポトしていない。 エラー: ISO Schematron 名前空間に不明な要素がある: 綴り字と大文字使用を確認する 注意: 不明な要素
ja: XSLTの名前空間を使用する。 スキーマエラー： <include>のために空hrefの属性がある。 エラー: Schematron <include>には不可能なURL がある エラー: 参照したファイルが含まれて、開けない : スキーマエラー：全体のスキーマではなく、フラグメントを含む <include> を使用する。 スキーマエラー： 'xslt2'の検索言語結合を使用している場合はXSDスキーマのみ読み込みできる。 スキーマエラー：ISO Schematron の名前空間には <import-schema>の要素は無効です。 XSLTの 名前空間を使用する。 注意: 変数は、"xpath" 検索言語結合を使用すべきではない。 注意: 変数は、"xpath" 検索言語結合を使用すべきではない。 マークアップエラー: <ns>にはＵＲＩの属性がない マークアップエラー: <ns>にはprefixの属性がない スキーマ実行 エラー: このスキーマは抽象的なパターンを持って、まだすでに前加工されることになっている。 マークアップエラー: <phase>にはidの属性がない マークアップエラー: <rule>にはcontextの要素がない マークアップエラー: 抽象的な <rule>にはid属性がない。 マークアップエラー: (2) 抽象的な <rule>にはcontext属性がない。 マークアップエラー: 抽象的な <rule>にはcontext属性がない。 マークアップエラー: <value-of>には selectの属性がない 注意: 子要素が含まれなくてはならない 参照エラー: 診断は " " 参照されているが宣言されていない。 注意: Schematron規則で"xsl"以外の接頭辞 XSLT 名前空間を使用することは、このプロセサーで サーポトしていない。 エラー: ISO Schematron 名前空間に不明な要素がある: 綴り字と大文字使用を確認する 注意: 不明な要素

source: absolute-position="" should be 'auto', 'absolute', 'fixed', or 'inherit'.
ja: absolute-position="" は「auto」、「absolute」、「fixed」又は「inherit」でなければなりません。

source: absolute-position="" token should be 'auto', 'absolute', 'fixed', or 'inherit'.
ja: absolute-position=""のトークンは「auto」、「absolute」、「fixed」又は「inherit」でなければなりません。

source: active-state="" should be 'link', 'visited', 'active', 'hover', or 'focus'.
ja: active-state="" は「link」、「visited」、「active」、「hover」又は「focus」でなければなりません。<

source: active-state="" token should be 'link', 'visited', 'active', 'hover', or 'focus'.
ja: active-state="" のトークンは「link」、「visited」、「active」、「hover」又は「focus」でなければなりません。

source: alignment-adjust="" should be 'auto', 'baseline', 'before-edge', 'text-before-edge', 'middle', 'central', 'after-edge', 'text-after-edge', 'ideographic', 'alphabetic', 'hanging', 'mathematical', 'inherit', Percent, or Length.
ja: alignment-adjust="" は「auto」、「baseline」、「before-edge」、「text-before-edge」、「middle」、「central」、「after-edge」、「text-after-edge」、「ideographic」、「alphabetic」、「hanging」、「mathematical」、「inherit」、パーセント、又は 長さでなければなりません。

source: alignment-adjust="" token should be 'auto', 'baseline', 'before-edge', 'text-before-edge', 'middle', 'central', 'after-edge', 'text-after-edge', 'ideographic', 'alphabetic', 'hanging', 'mathematical', or 'inherit'.
ja: alignment-adjust="" のトークンは「auto」、「baseline」、「before-edge」、「text-before-edge」、「middle」、「central」、「after-edge」、「text-after-edge」、「ideographic」、「alphabetic」、「hanging」、「mathematical」又は「inherit」でなければなりません。

source: alignment-baseline="" should be 'auto', 'baseline', 'before-edge', 'text-before-edge', 'middle', 'central', 'after-edge', 'text-after-edge', 'ideographic', 'alphabetic', 'hanging', 'mathematical', or 'inherit'.
ja: alignment-baseline="" は「auto」、「baseline」、「before-edge」、「text-before-edge」、「middle」、「central」、「after-edge」、「text-after-edge」、「ideographic」、「alphabetic」、「hanging」、「mathematical」又は「inherit」でなければなりません。

source: alignment-baseline="" token should be 'auto', 'baseline', 'before-edge', 'text-before-edge', 'middle', 'central', 'after-edge', 'text-after-edge', 'ideographic', 'alphabetic', 'hanging', 'mathematical', or 'inherit'.
ja: alignment-baseline=""のトークンは「auto」、「baseline」、「before-edge」、「text-before-edge」、「middle」、「central」、「after-edge」、「text-after-edge」、「ideographic」、「alphabetic」、「hanging」、「mathematical」又は「inherit」でなければなりません。

source: allowed-height-scale="" should be 'any', 'inherit', or Percent.
ja: allowed-height-scale="" は「any」、「inherit」又は パーセントでなければなりません。

source: allowed-height-scale="" token should be 'any' or 'inherit'.
ja: allowed-height-scale="" のトークンは「any」又は「inherit」でなければなりません。

source: allowed-width-scale="" should be 'any', 'inherit', or Percent.
ja: allowed-width-scale="" は「any」、「inherit」又は パーセントでなければなりません。

source: allowed-width-scale="" token should be 'any' or 'inherit'.
ja: allowed-width-scale="" のトークンは「any」又は「inherit」でなければなりません。

source: auto-restore="" should be 'true' or 'false'.
ja: auto-restore="" は「true」又は「false」でなければなりません。

source: auto-restore="" token should be 'true' or 'false'.
ja: auto-restore="" のトークンは「true」又は「false」でなければなりません。

source: background-attachment="" should be 'scroll', 'fixed', or 'inherit'.
ja: background-attachment=""は「scroll」、「fixed」又は「inherit」でなければなりません。

source: background-attachment="" token should be 'scroll', 'fixed', or 'inherit'.
ja: background-attachment="" のトークンは「scroll」、「fixed 又は「inherit」でなければなりません。

source: background-color="" should be Color or EnumerationToken.
ja: background-color="" は色又は列挙トークンでなければなりません。

source: background-color="" should be Color, 'aqua', 'black', 'blue', 'fuchsia', 'gray', 'green', 'lime', 'maroon', 'navy', 'olive', 'purple', 'red', 'silver', 'teal', 'white', 'yellow', 'transparent', or 'inherit'.
ja: background-color="" は 色、「aqua」、「black」、「blue」、「fuchsia」、「gray」、「green」、「lime」、「maroon」、「navy」、「olive」、「purple」、「red」、「silver」、「teal」、「white」、「yellow」、「transparent」又は「inherit」でなければなりません。

source: background-image="" should be URI or EnumerationToken.
ja: background-image="" はＵＲＩ又は列挙トークンでなければなりません。

source: background-image="" should be URI, 'none', or 'inherit'.
ja: background-image="" は ＵＲＩ、「none」又は「inherit」でなければなりません。

source: background-image="" enumeration token is ''.
ja: background-image="" の列挙トークンは「」です。

source: background-position-horizontal="" should be Percent, Length, 'left', 'center', 'right', or 'inherit'.
ja: background-position-horizontal=""は パーセント、長さ、「 left」、 center」、「right」又は inherit」でなければなりません。

source: background-position-horizontal="" should be Percent, Length, or EnumerationToken.
ja: background-position-horizontal="" はパーセント、長さ又は列挙トークンでなければなりません。

source: background-position-horizontal="" enumeration token is ''.
ja: background-position-horizontal="" の列挙トークンは「」です。

source: background-position-horizontal="" token should be 'left', 'center', 'right', or 'inherit'.
ja: background-position-horizontal="" のトークンは「left」、「center」、「right」又は「inherit」でなければなりません。

source: background-position-vertical="" should be Percent, Length, 'top', 'center', 'bottom', or 'inherit'.
ja: background-position-vertical="" はパーセント、長さ、「top」、「center」、「bottom」又は「inherit」でなければなりません。

source: background-position-vertical="" should be Percent, Length, or EnumerationToken.
ja: background-position-vertical="" はパーセント、長さ又は列挙トークンでなければなりません。

source: background-position-vertical="" enumeration token is ''.
ja: background-position-vertical="" の列挙トークンは「」です。

source: background-position-vertical="" token should be 'top', 'center', 'bottom', or 'inherit'.
ja: background-position-vertical="" のトークンは「top」、「center」、「bottom」又は「inherit」でなければなりません。

source: background-position="" should be '[ [<percentage> | <length> ]{1,2} | [ [top | center | bottom] || [left | center | right] ] ] | inherit'.
ja: background-position="" は「[ [<percentage> | <length> ]{1,2} | [ [top | center | bottom] || [left | center | right] ] ] | inherit」でなければなりません。

source: background-repeat="" should be 'repeat', 'repeat-x', 'repeat-y', 'no-repeat', or 'inherit'.
ja: background-repeat="" は「repeat」、「repeat-x」、「repeat-y」、「no-repeat」又は「inherit」でなければなりません。

source: background-repeat="" should be EnumerationToken.
ja: background-repeat="" は列挙トークンでなければなりません。

source: background-repeat="" enumeration token is ''.
ja: background-repeat="" の列挙トークンは「」です。

source: background-repeat="" token should be 'repeat', 'repeat-x', 'repeat-y', 'no-repeat', or 'inherit'.
ja: background-repeat="" のトークンは「repeat」、「repeat-x」、「repeat-y」、「no-repeat」又は「inherit」でなければなりません。

source: background="" should be '[<background-color> || <background-image> || <background-repeat> || <background-attachment> || <background-position> ]] | inherit'.
ja: background="" は「[<background-color> || <background-image> || <background-repeat> || <background-attachment> || <background-position> ]] | inherit」でなければなりません。

source: baseline-shift="" should be 'baseline', 'sub', 'super', 'inherit', Percent, or Length.
ja: baseline-shift="" は「baseline」、「sub」、「super」、「inherit」、パーセント、又は 長さでなければなりません。

source: baseline-shift="" token should be 'baseline', 'sub', 'super', or 'inherit'.
ja: baseline-shift="" のトークンは「baseline」、「sub」、「super」又は「inherit」でなければなりません。.

source: blank-or-not-blank="" should be 'blank', 'not-blank', 'any', or 'inherit'.
ja: blank-or-not-blank="" は「blank」、「not-blank」、「any」又は「inherit」でなければなりません。

source: blank-or-not-blank="" token should be 'blank', 'not-blank', 'any', or 'inherit'.
ja: blank-or-not-blank="" のトークンは「blank」、「not-blank」、「any」又は「inherit」でなければなりません。

source: block-progression-dimension="" should be 'auto', 'inherit', Length, or Percent.
ja: block-progression-dimension="" は「auto」、「inherit」、長さ、又は パーセントでなければなりません。

source: block-progression-dimension="" token should be 'auto' or 'inherit'.
ja: block-progression-dimension="" のトークンは「auto」又は「inherit」でなければなりません。

source: border-after-color="" should be Color, 'aqua', 'black', 'blue', 'fuchsia', 'gray', 'green', 'lime', 'maroon', 'navy', 'olive', 'purple', 'red', 'silver', 'teal', 'white', 'yellow', 'transparent', or 'inherit'.
ja: border-after-color="" は 色、「aqua」、「black」、「blue」、「fuchsia」、「gray」、「green」、「lime」、「maroon」、「navy」、「olive」「purple」「red」、「silver」、「teal」、「white」、「yellow」、「transparent」又は「inherit」でなければなりません。

source: border-after-precedence="" should be 'force', 'inherit', or Number.
ja: border-after-precedence="" は「force」、「inherit」又は 数でなければなりません。

source: border-after-precedence="" token should be 'force' or 'inherit'.
ja: border-after-precedence="" のトークンは「force」又は「inherit」でなければなりません。

source: border-after-style="" should be 'none', 'hidden', 'dotted', 'dashed', 'solid', 'double', 'groove', 'ridge', 'inset', 'outset', or 'inherit'.
ja: border-after-style="" は「none」、「hidden」、「dotted」、「dashed」、「solid」、「double」、「groove」、「ridge」、「inset」、「outset」又は「inherit」でなければなりません。

source: border-after-style="" token should be 'none', 'hidden', 'dotted', 'dashed', 'solid', 'double', 'groove', 'ridge', 'inset', 'outset', or 'inherit'.
ja: border-after-style="" のトークンは「none」、「hidden」、「dotted」、「dashed」、「solid」、「double」、「groove」、「ridge」、「inset」、「outset」又は「inherit」でなければなりません。

source: border-after-width="" should be 'thin', 'medium', 'thick', 'inherit', or Length.
ja: border-after-width=""は「thin」、「medium」、「thick」、「inherit」又は 長さでなければなりません。

source: border-after-width="" token should be 'thin', 'medium', 'thick', or 'inherit'.
ja: border-after-width=""のトークンは「thin」、「medium」、「thick」又は「inherit」でなければなりません。

source: border-before-color="" should be Color, 'aqua', 'black', 'blue', 'fuchsia', 'gray', 'green', 'lime', 'maroon', 'navy', 'olive', 'purple', 'red', 'silver', 'teal', 'white', 'yellow', 'transparent', or 'inherit'.
ja: border-before-color="" は 色、「aqua」、「black」、「blue」、「fuchsia」、「gray」、「green」、「lime」、「maroon」、「navy」、「olive」、「purple」、「red」、「silver」、「teal」、「white」、「yellow」、「transparent」又は「inherit」でなければなりません。

source: border-before-precedence="" should be 'force', 'inherit', or Number.
ja: border-before-precedence="" は「force」、「inherit」又は 数でなければなりません。

source: border-before-precedence="" token should be 'force' or 'inherit'.
ja: border-before-precedence="" のトークンは「force」又は「inherit」でなければなりません。

source: border-before-style="" should be 'none', 'hidden', 'dotted', 'dashed', 'solid', 'double', 'groove', 'ridge', 'inset', 'outset', or 'inherit'.
ja: border-before-style="" は「none」、「hidden」、「dotted」、「dashed」、「solid」、「double」、「groove」、「ridge」、「inset」、「outset」又は「inherit」でなければなりません。

source: border-before-style="" token should be 'none', 'hidden', 'dotted', 'dashed', 'solid', 'double', 'groove', 'ridge', 'inset', 'outset', or 'inherit'.
ja: border-before-style="" のトークンは「none」、「hidden」、「dotted」、「dashed」、「solid」、「double」、「groove」、「ridge」、「inset」、「outset」又は「inherit」でなければなりません。

source: border-before-width="" should be 'thin', 'medium', 'thick', 'inherit', or Length.
ja: border-before-width="" は「thin」、「medium」、「thick」、「inherit」又は長さでなければなりません。

source: border-before-width="" token should be 'thin', 'medium', 'thick', or 'inherit'.
ja: 3border-before-width="" のトークンは「thin」、「medium」、「thick」又は「inherit」でなければなりません。

source: border-bottom-color="" should be Color, 'aqua', 'black', 'blue', 'fuchsia', 'gray', 'green', 'lime', 'maroon', 'navy', 'olive', 'purple', 'red', 'silver', 'teal', 'white', 'yellow', 'transparent', or 'inherit'.
ja: border-bottom-color="" は 色、「aqua」、「black」、「blue」、「fuchsia」、「gray」、「green」、「lime」、「maroon」、「navy」、「olive」、「purple」、「red」、「silver」、「teal」、「white」、「yellow」、「transparent」又は「inherit」でなければなりません。

source: border-bottom-style="" should be 'none', 'hidden', 'dotted', 'dashed', 'solid', 'double', 'groove', 'ridge', 'inset', 'outset', or 'inherit'.
ja: border-bottom-style="" は「none」、「hidden」、「dotted」、「dashed」、「solid」、「double」、「groove」、「ridge」、「inset」、「outset」又は「inherit」でなければなりません。
